In [1]:
import pandas as pd

## Q1. List any five functions of the pandas library with execution.

### Ans:
- Five functions of the Pandas library:
    - `describe()`
        - returns basic statistical analysis of the dataframe.
    - `value_counts()`
        - returns number of occurences of each unique data values.
    - `sort_values()`
        - used to arrange the data values either in ascending or decending order, based on a specific column.
    - `apply()`
        - used to apply customized function over the entire dataframe either column wise or row wise.
    - `nunique()`
        - returns number of unique data values.

In [11]:
# create a dataframe
df = pd.DataFrame({
    "A": [4, 2, 1, 3],
    "B": [4, 2, 3, 2],
    "C": [9, 7, 7, 9],
})

In [12]:
df

   A  B  C
0  4  4  9
1  2  2  7
2  1  3  7
3  3  2  9

In [13]:
# use of `describe()`
df.describe()

              A         B         C
count  4.000000  4.000000  4.000000
mean   2.500000  2.750000  8.000000
std    1.290994  0.957427  1.154701
min    1.000000  2.000000  7.000000
25%    1.750000  2.000000  7.000000
50%    2.500000  2.500000  8.000000
75%    3.250000  3.250000  9.000000
max    4.000000  4.000000  9.000000

In [14]:
# use of `value_counts()`
df['B'].value_counts()

B
2    2
4    1
3    1
Name: count, dtype: int64

In [21]:
# use of `sort_values()`
df.sort_values(by='A', ascending=False)

   A  B  C
0  4  4  9
3  3  2  9
1  2  2  7
2  1  3  7

In [16]:
# use of `apply()`
df.apply(lambda x: x+3, axis=0)

   A  B   C
0  7  7  12
1  5  5  10
2  4  6  10
3  6  5  12

In [17]:
# use of `nunique()`
df['C'].nunique()

2

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [31]:
def reindex_df(df):
    new_index = range(1, len(df)*2+1, 2)
    df.index = new_index
    return df

In [33]:
df = reindex_df(df)

In [34]:
df

   A  B  C
1  4  4  9
3  2  2  7
5  1  3  7
7  3  2  9

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [37]:
def sum_first_three(df):
    result = df.iloc[:3]["Values"].sum()
    return result

In [38]:
df_values = pd.DataFrame({"Values" : [10, 20, 30, 40, 50]})

In [39]:
sum_first_three(df_values)

60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [40]:
df_text = pd.DataFrame({
    "Text":["Hello my dear", "I love my India", "I am a data scientist", "Would you like to go out with me"]
})

In [41]:
df_text

                               Text
0                     Hello my dear
1                   I love my India
2             I am a data scientist
3  Would you like to go out with me

In [50]:
def count_words(texts):
    words = texts.split(sep=" ")
    num_words = len(words)
    return num_words

In [51]:
df_text["word_count"] = df_text["Text"].apply(count_words)

In [52]:
df_text

                               Text  word_count
0                     Hello my dear           3
1                   I love my India           4
2             I am a data scientist           5
3  Would you like to go out with me           8

## Q5. How are DataFrame.size and DataFrame.shape different?

### Ans:
- `DataFrame.size`
    - It returns the total number of data values in a dataframe, i.e, the total number of rows multiplied by the total number of columns.
- `DataFrame.shape`
    - It returns the dimension of a dataframe in the form of a tuple with two elements, first represents the number of rows, and the second represents the number of columns.

In [54]:
df.size

12

In [56]:
df.shape

(4, 3)

## Q6. Which function of pandas do we use to read an excel file?

### Ans:
- `read_excel()` of Pandas is used to read excel file.

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [57]:
df_emails = pd.DataFrame({
    "email": ["abc@gmail.com", "sasi.kamal@gmail.com", "liza_dutta@gmail.com"]
})

In [58]:
df_emails

                  email
0         abc@gmail.com
1  sasi.kamal@gmail.com
2  liza_dutta@gmail.com

In [62]:
def extract_usrname(email):
    name = email.split(sep="@")
    return name[0]

In [63]:
df_emails["username"] = df_emails["email"].apply(extract_usrname)

In [64]:
df_emails

                  email    username
0         abc@gmail.com         abc
1  sasi.kamal@gmail.com  sasi.kamal
2  liza_dutta@gmail.com  liza_dutta

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:
|   | A | B | C |
|:-:|:-:|:-:|:-:|
| 0 | 3 | 5 | 1 |
| 1 | 8 | 2 | 7 |
| 2 | 6 | 9 | 4 |
| 3 | 2 | 3 | 5 |
| 4 | 9 | 1 | 2 |

Your function should select the following rows: A B C
|   | A | B | C |
|:-:|:-:|:-:|:-:|
| 1 | 8 | 2 | 7 |
| 2 | 6 | 9 | 4 |
| 4 | 9 | 1 | 2 |

The function should return a new DataFrame that contains only the selected rows.

In [75]:
df_data = pd.DataFrame({
    "A" : [3, 8, 6, 2, 9],
    "B" : [5, 2, 9, 3, 1],
    "C" : [1, 7, 4, 5, 2]
})

In [76]:
df_data

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [77]:
df_data_filtered = df_data[(df_data["A"] > 5) & (df_data["B"] < 10)]

In [78]:
df_data_filtered

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [79]:
values_df = pd.DataFrame({
    "values": [4, 5, 17, 21, 11, 9, 32, 73]
})

In [80]:
values_df

   values
0       4
1       5
2      17
3      21
4      11
5       9
6      32
7      73

In [157]:
values_df["values"].mean()

21.5

In [158]:
values_df["values"].median()

14.0

In [159]:
values_df["values"].std()

22.765889270698704

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [86]:
sales_data = {'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08'],
        'Sales': [10, 20, 30, 40, 50, 60, 70, 80]}

In [87]:
sales_df = pd.DataFrame(sales_data)

In [88]:
sales_df

         Date  Sales
0  2022-01-01     10
1  2022-01-02     20
2  2022-01-03     30
3  2022-01-04     40
4  2022-01-05     50
5  2022-01-06     60
6  2022-01-07     70
7  2022-01-08     80

In [91]:
sales_df["Moving_avg"] = sales_df["Sales"].rolling(window=7, min_periods=1).mean()

In [92]:
print(sales_df)

         Date  Sales  Moving_avg
0  2022-01-01     10        10.0
1  2022-01-02     20        15.0
2  2022-01-03     30        20.0
3  2022-01-04     40        25.0
4  2022-01-05     50        30.0
5  2022-01-06     60        35.0
6  2022-01-07     70        40.0
7  2022-01-08     80        50.0

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

|   |Date|
|:-:|:-:|
|0|2023-01-01|
|1|2023-01-02|
|2|2023-01-03|
|3|2023-01-04|
|4|2023-01-05|

Your function should create the following DataFrame:

|   |Date|Weekday|
|:-:|:-:|:-|
|0|2023-01-01|Sunday|
|1|2023-01-02|Monday|
|2|2023-01-03|Tuesday|
|3|2023-01-04|Wednesday|
|4|2023-01-05|Thursday|

In [93]:
dates = {
    "Date": [
        "2022-01-01",
        "2022-01-02",
        "2022-01-03",
        "2022-01-04",
        "2022-01-05",
    ]
}

In [94]:
dates_df = pd.DataFrame(dates)

In [95]:
dates_df

         Date
0  2022-01-01
1  2022-01-02
2  2022-01-03
3  2022-01-04
4  2022-01-05

In [99]:
def day_name(date):
    return pd.to_datetime(date).day_name()

In [100]:
dates_df["Weekday"] = dates_df["Date"].apply(day_name)

In [101]:
dates_df

         Date    Weekday
0  2022-01-01   Saturday
1  2022-01-02     Sunday
2  2022-01-03     Monday
3  2022-01-04    Tuesday
4  2022-01-05  Wednesday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [147]:
dates_23 = {
    "Date" : [
        '2022-12-31',
        '2023-01-01',
        '2023-01-15',
        '2023-01-21',
        '2023-01-31',
        '2023-02-01',
    ]
}

In [148]:
dates_23_df = pd.DataFrame(dates_23)

In [149]:
dates_23_df

         Date
0  2022-12-31
1  2023-01-01
2  2023-01-15
3  2023-01-21
4  2023-01-31
5  2023-02-01

In [150]:
# first method
def select_dates_1(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    return df.loc[(df["Date"] >= start_date) & (df["Date"] <= end_date)]

In [151]:
result_1 = select_dates_1(dates_23_df)

In [152]:
result_1

         Date
1  2023-01-01
2  2023-01-15
3  2023-01-21
4  2023-01-31

In [153]:
# second method
def select_dates_2(df):
    df["Date"] = pd.to_datetime(df["Date"])
    date_range = pd.date_range(start='2023-01-01', end='2023-01-31')
    return df[df["Date"].isin(date_range)]

In [154]:
result_2 = select_dates_2(dates_23_df)

In [155]:
result_2

        Date
1 2023-01-01
2 2023-01-15
3 2023-01-21
4 2023-01-31

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

### Ans:
- To use the basic functions of Pandas, we need to import the the Pandas library itself, using the `import` statement.

    - `import pandas as pd`